In [41]:
#importing data into jupyter notebook
import pandas as pd
import numpy as np
data=pd.read_csv("Salary_Data_Based_country_and_race.csv")
data.head()

,unique_identifier,age,gender,education_level,job_title,years_of_experience,salary,country,race
0,0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0,UK,White
1,1,28.0,Female,Master's,Data Analyst,3.0,65000.0,USA,Hispanic
2,2,45.0,Male,PhD,Senior Manager,15.0,150000.0,Canada,White
3,3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0,USA,Hispanic
4,4,52.0,Male,Master's,Director,20.0,200000.0,USA,Asian

In [12]:
#SORTING THE DATA
#Formatting the headings of the variables to snake case heading
data.columns=data.columns.str.lower()

In [13]:
#DATA CLEANING
#checking for missing values
data.isnull()
#There are no missing values

,unique_identifier,age,gender,education_level,job_title,years_of_experience,salary,country,race
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
6699,False,False,False,False,False,False,False,False,False
6700,False,False,False,False,False,False,False,False,False
6701,False,False,False,False,False,False,False,False,False
6702,False,False,False,False,False,False,False,False,False
6703,False,False,False,False,False,False,False,False,False

In [15]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [11]:
#Filtering out the data to keep only rows with gender as male or female

data=data[data["gender"].isin(["Male","Female"])]

#mean salary earned by each gender
gender_group = data.groupby('gender')
mean_salary_by_gender = gender_group['salary'].mean()
print(mean_salary_by_gender)

gender
Female    107888.998672
Male      121389.870915
Name: salary, dtype: float64

In [3]:
#Calculating the maximum and minimum salaries earned for each education level
import pandas as pd
data=pd.read_csv("Salary_Data_Based_country_and_race.csv")
new_group= data.groupby("education_level")

min_salaries = new_group["salary"].min()
max_salaries = new_group["salary"].max()

print("\nMinimum salary per education level:")
print(min_salaries)
print("\nMaximum salary per education level:")
print(max_salaries)

Minimum salary per education level:
education_level
Bachelor's              350.0
Bachelor's Degree       500.0
High School           25000.0
Master's              40000.0
Master's Degree       32000.0
PhD                     579.0
phD                  120000.0
Name: salary, dtype: float64

Maximum salary per education level:
education_level
Bachelor's           250000.0
Bachelor's Degree    250000.0
High School          166109.0
Master's             200000.0
Master's Degree      228000.0
PhD                  250000.0
phD                  120000.0
Name: salary, dtype: float64